src/cf/DataProcessors/ExportImportDataCollapsingUserReferencesInSeparatedData.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>ExportImportDataCollapsingUserReferencesInSeparatedData</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/cf/InformationRegisters/SharedUsers.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>SharedUsers</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>SequenceNumber</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>UserName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>IBUserID</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Catalogs/Users.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Users</Name>
			<Comment>APK:413 - # 744.2.1.1 it is Acceptable not to disable the selection history, since it is used, and the selection redefinition is fixed, that is, service and invalid users will not get into it, but if they somehow got into it, this is not a problem</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Invalid</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Department</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Department</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Individual</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Individual</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsInternal</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Prepared</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IBUserID</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ServiceUserID</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DeleteInfobaseUserProperties</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Photo</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>AdditionalAttributes</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Property</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.AdditionalAttributesAndInfo</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Value</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.AdditionalAttributesAndInfo</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>TextString</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ContactInformation</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Type</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ContactInformationTypes</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Kind</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ContactInformationKinds</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Presentation</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>FieldValues</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Country</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>State_SSLym</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>City</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>EMAddress</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ServerDomainName</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PhoneNumber</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PhoneNumberWithoutCodes</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>KindForList</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ContactInformationKinds</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Value</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/DataProcessors/ExportImportDataCollapsingUserReferencesInSeparatedData/Ext/ObjectModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// 
//  
// 
// 
// 
///////////////////////////////////////////////////////////////////////////////////////////////////////

#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region Variables

Var CurrentUnspecifedUserID;
Var SourceUnspecifedUserID;
Var SavedRefsToUnspecifiedUser;

#EndRegion

#Region Internal

#Region DataExportHandlers

Procedure BeforeExportData(Container) Export
	
	CurrentUnspecifedUserID = UsersInternal.CreateUnspecifiedUser().UUID();
	
	FileName = Container.CreateCustomFile("xml", DataTypeForUnspecifiedUserIDExport());
	WriteObjectToFile(CurrentUnspecifedUserID, FileName);
	
EndProcedure

// 
// 
//
// Parameters:
//  Container - DataProcessorObject.ExportImportDataContainerManager
//  ObjectExportManager - DataProcessorObject.ExportImportDataInfobaseDataExportManager
//  Serializer - XDTOSerializer
//  Object - ConstantValueManager
//         - CatalogObject
//         - DocumentObject
//         - BusinessProcessObject
//         - TaskObject
//         - ChartOfAccountsObject
//         - ExchangePlanObject
//         - ChartOfCharacteristicTypesObject
//         - ChartOfCalculationTypesObject
//         - InformationRegisterRecordSet
//         - AccumulationRegisterRecordSet
//         - AccountingRegisterRecordSet
//         - CalculationRegisterRecordSet
//         - SequenceRecordSet
//         - RecalculationRecordSet
//  Artifacts - Array
//  Cancel - Boolean
//
Procedure BeforeExportObject(Container, ObjectExportManager, Serializer, Object, Artifacts, Cancel) Export
	
	If TypeOf(Object) <> Type("CatalogObject.Users") Then
		Raise StringFunctionsClientServer.SubstituteParametersToString(
			NStr("en = 'Handler %2 cannot handle metadata object %1.';"),
			Object.Metadata().FullName(),
			"ExportImportDataCollapsingUserReferencesInSeparatedData.BeforeExportObject");
	EndIf;
		
	If Object.Ref.UUID() = CurrentUnspecifedUserID Then
		
		NewArtifact = XDTOFactory.Create(UnspecifiedUserArtifactType());
		Artifacts.Add(NewArtifact);
		
	ElsIf UsersInternalSaaS.UserRegisteredAsShared(Object.IBUserID) Then
		
		NewArtifact = XDTOFactory.Create(SharedUserArtifactType());
		NewArtifact.UserName = InternalNameOfSharedUser(Object.IBUserID);
		Artifacts.Add(NewArtifact);
		
	EndIf;
	
EndProcedure

Procedure AfterExportObject(Container, ObjectExportManager, Serializer, Object, Artifacts) Export
	
	If TypeOf(Object) <> Type("CatalogObject.Users") Then
		Raise StringFunctionsClientServer.SubstituteParametersToString(
			NStr("en = 'Handler %2 cannot handle metadata object %1.';"),
			Object.Metadata().FullName(),
			"ExportImportDataCollapsingUserReferencesInSeparatedData.AfterExportObject");
	EndIf;
		
	If Object.Ref.UUID() <> CurrentUnspecifedUserID Then
		
		IsSharedUserRef = UsersInternalSaaS.UserRegisteredAsShared(
			Object.IBUserID);
		
		NaturalKey = New Structure("Shared2", IsSharedUserRef);
		ObjectExportManager.YouNeedToMatchLinkWhenDownloading(Object.Ref, NaturalKey);
		
	EndIf;
		
EndProcedure

#EndRegion

#Region DataImportHandlers

// Called before loading data.
//
// Parameters:
//  Container - DataProcessorObject.ExportImportDataContainerManager -  
//    the container manager used in the data loading process. For more information, see the comment
//    on the software interface for processing the unloading of the data of the Manager container.
//
Procedure BeforeImportData(Container) Export
	
	CurrentUnspecifedUserID = UsersInternal.CreateUnspecifiedUser().UUID();
	
	FileName = Container.GetCustomFile(DataTypeForUnspecifiedUserIDExport());
	SourceUnspecifedUserID = ReadObjectFromFile(FileName);
	
EndProcedure

Procedure BeforeMapRefs(Container, MetadataObject, SourceRefsTable, StandardProcessing, Cancel) Export
	
	If MetadataObject = Metadata.Catalogs.Users Then
		
		StandardProcessing = False;
		
	Else
		
		Raise NStr("en = 'Data type is specified incorrectly';");
		
	EndIf;
	
EndProcedure

Function MapRefs(Container, RefsMapManager, SourceRefsTable) Export
	
	ColumnName = RefsMapManager.SourceLinkColumnName_();
	
	Result = New ValueTable();
	Result.Columns.Add(ColumnName, New TypeDescription("CatalogRef.Users"));
	Result.Columns.Add("Ref", New TypeDescription("CatalogRef.Users"));
	
	UnspecifiedUserMapping = Result.Add();
	UnspecifiedUserMapping[ColumnName] =
		Catalogs.Users.GetRef(SourceUnspecifedUserID);
	UnspecifiedUserMapping.Ref =
		Catalogs.Users.GetRef(CurrentUnspecifedUserID);
	
	MergeSharedUsers = False;
	MergeSeparatedUsers = False;
	
	If Common.DataSeparationEnabled() Then
		
		If Container.ImportParameters().Property("CollapseSeparatedUsers") Then
			MergeSeparatedUsers = Container.ImportParameters().CollapseSeparatedUsers;
		Else
			MergeSeparatedUsers = False;
		EndIf;
		
	Else
		MergeSharedUsers = True;
		MergeSeparatedUsers = False;
	EndIf;
	
	For Each SourceRefsTableRow In SourceRefsTable Do
		
		If SourceRefsTableRow.Shared2 Then
			
			If MergeSharedUsers Then
				
				UserMapping = Result.Add();
				UserMapping[ColumnName] = SourceRefsTableRow[ColumnName];
				UserMapping.Ref =
					Catalogs.Users.GetRef(CurrentUnspecifedUserID);
				
			EndIf;
			
		Else
			
			If MergeSeparatedUsers Then
				
				UserMapping = Result.Add();
				UserMapping[ColumnName] = SourceRefsTableRow[ColumnName];
				UserMapping.Ref =
					Catalogs.Users.GetRef(CurrentUnspecifedUserID);
				
			EndIf;
			
		EndIf;
		
	EndDo;
	
	Return Result;
	
EndFunction

// Executes handlers before loading a specific type of data.
//
// Parameters:
//  Container - DataProcessorObject.ExportImportDataContainerManager -  
//		the container manager used in the data upload process. For more information, see the comment
//		on the software interface for processing the unloading of the data of the Manager container.
//  MetadataObject - MetadataObject - 
//  Cancel - Boolean -  indicates whether this operation was performed.
//
Procedure BeforeImportType(Container, MetadataObject, Cancel) Export
	
	If UsersInternalSaaSCached.RecordSetsWithRefsToUsersList().Get(MetadataObject) <> Undefined Then
		
		SavedRefsToUnspecifiedUser = New ValueTable();
		
		For Each Dimension In MetadataObject.Dimensions Do
			
			SavedRefsToUnspecifiedUser.Columns.Add(Dimension.Name, Dimension.Type);
			
		EndDo;
		
	Else
		
		SavedRefsToUnspecifiedUser = Undefined;
		
	EndIf;
	
EndProcedure

Procedure BeforeImportObject(Container, Object, Artifacts, Cancel) Export
	
	If TypeOf(Object) = Type("CatalogObject.Users") Then
		
		// 
		IsSourceUnspecifiedUser = False;
		UtilityUsersIDS = UtilityUsersIDS();
		
		For Each Artifact In Artifacts Do
			
			If Artifact.Type() = SharedUserArtifactType() Then
				
				FoundRow = UtilityUsersIDS.Find(Artifact.UserName, "UserName");
				If FoundRow = Undefined Then
					Id = New UUID("00000000-0000-0000-0000-000000000000");
				Else
					Id = FoundRow.IBUserID;
				EndIf;
				
				If UsersInternalSaaS.UserRegisteredAsShared(Id) Then
					
					Object.IBUserID = Id;
					Object.Description = UsersInternalSaaS.InternalUserFullName(Id);
					
				EndIf;
				
			ElsIf Artifact.Type() = UnspecifiedUserArtifactType() Then
				
				IsSourceUnspecifiedUser = True;
				
			EndIf;
			
		EndDo;
		
		If Object.Ref.UUID() = CurrentUnspecifedUserID And Not IsSourceUnspecifiedUser Then
			Cancel = True;
		EndIf;
		
	ElsIf UsersInternalSaaSCached.RecordSetsWithRefsToUsersList().Get(Object.Metadata()) <> Undefined Then
		
		// 
		CollapseRefsToUsersInSet(Object);
		
	Else
		Raise StringFunctionsClientServer.SubstituteParametersToString(
			NStr("en = 'Handler %2 cannot handle metadata object %1.';"),
			Object.Metadata().FullName(),
			"ExportImportDataCollapsingUserReferencesInSeparatedData.BeforeImportObject");
	EndIf;
	
EndProcedure

#EndRegion

#EndRegion

#Region Private

Function DataTypeForUnspecifiedUserIDExport()
	
	Return "1cfresh\ApplicationData\DefaultUserRef";
	
EndFunction

Function SharedUserArtifactType() 
	
	Return XDTOFactory.Type(Package(), "UnseparatedUser");
	
EndFunction

Function UnspecifiedUserArtifactType()
	
	Return XDTOFactory.Type(Package(), "UndefinedUser");
	
EndFunction

Function Package()
	
	Return "http://www.1c.ru/1cFresh/Data/Artefacts/ServiceUsers/1.0.0.1";
	
EndFunction

Function InternalNameOfSharedUser(Val Id)
	
	Manager = InformationRegisters.SharedUsers.CreateRecordManager();
	Manager.IBUserID = Id;
	Manager.Read();
	If Manager.Selected() Then
		Return Manager.UserName;
	Else
		Return "";
	EndIf;
	
EndFunction

Function UtilityUsersIDS()
	
	Query = New Query;
	Query.Text =
	"SELECT
	|	SharedUsers.UserName AS UserName,
	|	SharedUsers.IBUserID AS IBUserID
	|FROM
	|	InformationRegister.SharedUsers AS SharedUsers";
	
	Result = Query.Execute().Unload();
	Result.Indexes.Add("UserName");
	
	Return Result;
	
EndFunction

Procedure CollapseRefsToUsersInSet(RecordSet)
	
	UnspecifiedUserRef = Catalogs.Users.GetRef(CurrentUnspecifedUserID);
	
	RecordsToDelete = New Array();
	
	RegisterMetadata = RecordSet.Metadata(); // MetadataObjectInformationRegister
	
	For Each Record In RecordSet Do
		
		StatusBarFilter = New Structure();
		
		For Each Dimension In RegisterMetadata.Dimensions Do
			
			ValueToCheck = Record[Dimension.Name];
			
			If ValueIsFilled(ValueToCheck) Then
				
				If TypeOf(ValueToCheck) = Type("CatalogRef.Users") Then
					
					If ValueToCheck = UnspecifiedUserRef Then
						
						StatusBarFilter.Insert(Dimension.Name, ValueToCheck);
						
					EndIf;
					
				EndIf;
				
			EndIf;
			
		EndDo;
		
		If StatusBarFilter.Count() > 0 Then
			
			If SavedRefsToUnspecifiedUser.FindRows(StatusBarFilter).Count() = 0 Then
				
				StatusBar = SavedRefsToUnspecifiedUser.Add();
				FillPropertyValues(StatusBar, Record);
				
			Else
				
				RecordsToDelete.Add(Record);
				
			EndIf;
			
		EndIf;
		
	EndDo;
	
	For Each RecordToDelete In RecordsToDelete Do
		
		RecordSet.Delete(RecordToDelete);
		
	EndDo;
	
EndProcedure

// Writes an object to a file.
//
// Parameters:
//  Object - UUID -  the object being recorded.
//  FileName - String -  file path.
//  Serializer - XDTOSerializer -  serializer.
//
Procedure WriteObjectToFile(Val Object, Val FileName, Serializer = Undefined)
	
	WriteStream = New XMLWriter();
	WriteStream.OpenFile(FileName);
	
	WriteObjectToStream(Object, WriteStream, Serializer);
	
	WriteStream.Close();
	
EndProcedure

// Writes an object to the write stream.
//
// Parameters:
//  Object - UUID -  the object being recorded.
//  WriteStream - XMLWriter -  writer thread.
//  Serializer - XDTOSerializer -  serializer.
//
Procedure WriteObjectToStream(Val Object, WriteStream, Serializer = Undefined)
	
	If Serializer = Undefined Then
		Serializer = XDTOSerializer;
	EndIf;
	
	WriteStream.WriteStartElement("Data");
	
	NamespacesPrefixes = NamespacesPrefixes();
	For Each NamespacesPrefix In NamespacesPrefixes Do
		WriteStream.WriteNamespaceMapping(NamespacesPrefix.Value, NamespacesPrefix.Key);
	EndDo;
	
	Serializer.WriteXML(WriteStream, Object, XMLTypeAssignment.Explicit);
	
	WriteStream.WriteEndElement();
	
EndProcedure

// Returns an object from a file.
//
// Parameters:
//  FileName - String -  file path.
//
// Returns:
//  CatalogObject.Users
//  Undefined
//
Function ReadObjectFromFile(Val FileName)
	
	ReaderStream = New XMLReader();
	ReaderStream.OpenFile(FileName);
	ReaderStream.MoveToContent();
	
	Object = ReadObjectFromStream(ReaderStream);
	
	ReaderStream.Close();
	
	Return Object;
	
EndFunction

// Returns an object from a file.
//
// Parameters:
//  ReaderStream - XMLReader -  the flow of reading.
//
// Returns:
//  CatalogObject.Users
//  Undefined
//
Function ReadObjectFromStream(ReaderStream)
	
	If ReaderStream.NodeType <> XMLNodeType.StartElement Or ReaderStream.Name <> "Data" Then
		Raise StringFunctionsClientServer.SubstituteParametersToString(
			NStr("en = 'XML reading error. Invalid file format. Start of ""%1"" element is expected.';"),
			"Data");
	EndIf;
	
	If Not ReaderStream.Read() Then
		Raise NStr("en = 'XML reading error. File end is detected.';");
	EndIf;
	
	Object = XDTOSerializer.ReadXML(ReaderStream);
	Return Object;
	
EndFunction

// Returns prefixes for commonly used namespaces.
//
// Returns:
//  Map of KeyAndValue:
//  Key-String - namespace.
//  Value - string-prefix.
//
Function NamespacesPrefixes() Export
	
	Result = New Map();
	
	Result.Insert("http://www.w3.org/2001/XMLSchema", "xs");
	Result.Insert("http://www.w3.org/2001/XMLSchema-instance", "xsi");
	Result.Insert("http://v8.1c.ru/8.1/data/core", "v8");
	Result.Insert("http://v8.1c.ru/8.1/data/enterprise", "ns");
	Result.Insert("http://v8.1c.ru/8.1/data/enterprise/current-config", "cc");
	Result.Insert("http://www.1c.ru/1cFresh/Data/Dump/1.0.2.1", "dmp");
	
	Return New FixedMap(Result);
	
EndFunction

#EndRegion

#Else
Raise NStr("en = 'Invalid object call on the client.';");
#EndIf
